app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "sdfasdf"], ["created_at", "2014-11-04 19:59:39.113299"], ["updated_at", "2014-11-04 19:59:39.113299"], ["user_id", 5]]
---
      def create
        secure_post = params.require(:micropost).permit(:content)
        @micropost = current_user.microposts.build(secure_post)
        if @micropost.save