app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
      def create
        secure_params = params.require(:user).permit(:name, :email,
                                  :password, :password_confirmation)
        @user = User.new(secure_params)
        if @user.save